env.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:p="http://travelcompany.example.org/reservation/travel" xmlns:q="http://travelcompany.example.org/reservation/hotels" xmlns:m="http://travelcompany.example.org/reservation" xmlns:n="http://mycompany.example.com/employees" xmlns:ns7="http://travelcompany.example.org/reservation/travel/travel">
    <env:Head>
        <m:reservation m:role="http://www.w3.org/2003/05/soap-envelope/role/next" m:mustUnderstand="true">
            <m:reference>uuid:093a2da1-q345-739r-ba5d-pqff98fe8j7d</m:reference>
            <m:dateAndTime>2001-11-29T13:20:00.000-05:00</m:dateAndTime>
        </m:reservation>
        <n:passenger n:role="http://www.w3.org/2003/05/soap-envelope/role/next" n:mustUnderstand="true">
            <n:name>Mikhail</n:name>
        </n:passenger>
    </env:Head>
    <env:Body>
        <p:itinerary>
            <p:departure>
                <p:departing>Moscow</p:departing>
                <p:arriving>London</p:arriving>
                <p:departureDate>2001-12-14</p:departureDate>
                <p:departureTime>2001-12-14</p:departureTime>
                <p:seatPreference>aisle</p:seatPreference>
            </p:departure>
            <p:return>
                <p:departing>Moscow</p:departing>
                <p:arriving>London</p:arriving>
                <p:departureDate>2001-12-14</p:departureDate>
                <p:departureTime>2001-12-14</p:departureTime>
            </p:return>
        </p:itinerary>
        <q:lodging>
            <q:preference>none</q:preference>
        </q:lodging>
    </env:Body>
</env:Envelope>
